class Product {
  final String name;
  final String description;
  final double price;
  final String imageUrl;

  Product({
    required this.name,
    required this.description,
    required this.price,
    required this.imageUrl,
  });
}

final List<Product> products = [
  Product(name: 'Компьютерный стол, Письменный стол Ирис (Тип 3) с пропусками для проводов и кабель-каналом 160х70х75',
      description: '''Флагманский товар бренда ZAMM — столы на металлокаркасе для дома и офиса. Вы найдете многообразие вариантов на любой вкус, цвет и размер. Одна из наших классических моделей — Стол Ирис ТР .

  Особенности модели:
      — Классическая усиленная конструкция на двух О-образных опорах с эффектом «парящей столешницей»;
      — Особая устойчивость;
      — Стол может быть выполнен в одном из 6-ти цветовых решениях столешницы и 2-х цветов металлокаркаса;
      — Каждая из моделей столов представлена в 4-х версиях с разным набором дополнительных аксессуаров.
      ''', price: 30695, imageUrl: 'https://ir.ozone.ru/s3/multimedia-5/wc600/6903129425.jpg'),
  Product(name: 'Чипсы картофельные Pringles со вкусом сметаны и лука, 165 г',
      description: '''Сметана и лук еще никогда не были такими вкусными. Идеальное сочетание вкуса чипсов удовлетворят чувство голода на длительное время.  Продукт поставляется в герметичной тубе и идеально подходит для того, чтобы делиться ею с друзьями или перекусывать на вечеринках. Ровные ломтики уникальной формы и одинакового размера были упакованы в банку цилиндрической формы, которая позволяет добиться максимального уровня сохранности продукта при транспортировке. 
  Ароматная смесь сметаны и лука, которой вы будете наслаждаться до самого последнего хрустящего кусочка.''', price: 329, imageUrl: 'https://ir.ozone.ru/s3/multimedia-p/wc600/6235234465.jpg'),
  Product(name: 'Преобразователь ржавчины (антикор) c цинком удалитель ржавчины для авто LAVR, 500 мл / Ln1436', description: 'Преобразователь ржавчины с цинком LAVR, 500 мл / Ln1436', price: 296, imageUrl: 'https://ir.ozone.ru/s3/multimedia-1-w/wc600/7149922016.jpg'),
  Product(name: 'Kase Объектив HD Мастер Mакрообъектив Макролинза для Tелефона, Макро линза для Cмартфон',
      description: '''Объектив Kase Master Macro Lens Pro
 изготовлен из высококачественного оптического стекла, 5 элементов в 4 группах. Новая оптическая конструкция значительно улучшает качество изображения фотографий, обеспечивая более четкое изображение без искажений. Объектив представляет собой профессиональный макрообъектив для мобильного телефона, который отлично подходит для макросъемки насекомых, цветов и т.д.''', price: 5653, imageUrl: 'https://ir.ozone.ru/s3/multimedia-x/wc600/6666959085.jpg'),
  Product(name: 'Бумага офисная "SvetoCopy", 500 листов, А4. 000877',
      description: '''Офисная бумага "Svetocopy" - идеальная экономичная бумага для ежедневного делопроизводства, которая подходит для любого принтера и копировального аппарата, независимо от его функционального назначения, набора функций и периода операционной деятельности. 
   Оптимальные показатели белизны, структуры и однородности листа гарантируют высокое качество печати. 
  Характеристики: 
  Плотность: 80 г/м2. 
  Размер листа: 29,7 см х 21 см. 
  Количество: 500 листов. 
  Яркость: 95 %. 
  Цвет: белый.''', price: 323, imageUrl: 'https://ir.ozone.ru/s3/multimedia-1-i/wc600/7090155510.jpg'),
  Product(name: 'DeLonghi Автоматическая кофемашина Magnifica ECAM 22.110.SB, серебристый',
      description: '''Напряжение/частота: 220-240 В/50-60 Гц
  Система капучино: смешивает пар, воздух и молоко для получения нежной взбитой пены для капучино
  Настройка всех параметров напитка: количество воды на чашку, крепость, температура
  Возможность настроить мой кофе
  Использование как кофейных зерен так и молотого кофе
  Съемный компактный блок приготовления вместимостью от 6 до 14 г
  Долговечная кофемолка с регулировкой до 13 степеней помола
  Программируемое количество кофе на порцию
  Программируемое количество воды на порцию
  Предварительное смачивание
  Возможность установки кофейных чашек высотой от 86 до 142 мм
  Программируемое автоматическое включение и выключение
  Счетчик приготовленных чашек
  Новый термоблок гарантирует эспрессо идеальной температуры
  Контейнер для кофе, сохраняющий аромат
  Контейнер для жмыха на 14 порций с индикацией наполненности
  Съемный резервуар для воды с индикатором уровня воды (1,8 л)
  Автоматическое ополаскивание и программа очистки от накипи
  Настраиваемая жесткость воды
  Съемный поддон для капель с индикатором уровня воды''', price: 33615, imageUrl: 'https://ir.ozone.ru/s3/multimedia-k/wc600/6504181676.jpg'),
  Product(name: 'Гайка Шестигранная M6, ГОСТ 5927-70, 100 шт., 220 г',
      description: 'Гайка шестигранная DIN 934 / ГОСТ 5927-70 является самым популярным и распространенным типом гаек. Данный тип гаек широко используют в строительстве, мебельном производстве, при сборке узлов, агрегатов и машин. Конструктивно гайка представляет собой шестигранное изделие с внутренней резьбой.', price: 162, imageUrl: 'https://ir.ozone.ru/s3/multimedia-1-k/wc600/6920954444.jpg'),
  Product(name: 'Салфетки для очков из микрофибры, для очков, оптики, объектива, стеклянных линз, комплект 5 шт',
      description: '''Салфетка для ухода за очками из микрофибры, подходит для всех типов линз, включая линзы с различными покрытиями, а также для любых оптических изделий, смартфонов, планшетов и других гаджетов.''', price: 194, imageUrl: 'https://ir.ozone.ru/s3/multimedia-1/wc600/6617825749.jpg'),
  Product(name: 'Вешалка-плечики для одежды Ridberg 20 шт (Black)',
      description: '''Вешалки-плечики для одежды Ridberg подходят для хранения верхней и повседневной одежды.

  Товар подойдет для тех, кто хочет сохранить свою одежду в идеальном состоянии и нуждается в качественных вешалках. Резиновые вешалки с металлическим основанием и выемками для бретелей - отличный выбор для вашего гардероба.''', price: 480, imageUrl: 'https://ir.ozone.ru/s3/multimedia-j/wc600/6854276071.jpg'),
  Product(name: 'Комод для одежды Хелен с ящиками, с полками, 150х46х96 см, Дуб Крафт золотой / Графит серый',
      description: '''Основательный и удобный комод Хелен поможет разместить большое количество вещей: от одежды и обуви до разных мелочей и аксессуаров. Благодаря светлым фасадам без лицевой фурнитуры он не перегружает интерьер. Дверцы и ящики закрываются плавно и без резких звуков, что делает комод еще комфортнее.''', price: 8219, imageUrl: 'https://ir.ozone.ru/s3/multimedia-1-x/wc600/7147912353.jpg'),
];
